ruby/L.org
#+TITLE:     L
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>


* [[https://wordsinasentence.com/labile-in-a-sentence/][Labile]]

  =easily or frequently changed=

  - My body’s response to dairy products is labile and usually hurts worse when I exercise after consumption.
  - Some of the tribe’s customs were labile, while others are never changed and are followed to the t.
  - Emotionally labile patients are not given stimulants since they tend to can cause moods to shift dramatically.
  - The labile currency can be changed out easily when visiting a different country.




* [[https://wordsinasentence.com/laceration-in-a-sentence/][Laceration]]

  =an irregular open wound caused by a blunt impact to soft tissue=

  - Because the laceration was so deep and ugly, Dick was rushed to the emergency room by an ambulance.
  - Joe suffered a laceration to his right temple when he was tossed off of his bike.
  - After examining Jennifer’s hand from every angle, the nurse said that the laceration would heal by itself and that stitches were unnecessary.
  - Linda’s foot laceration was the result of a fall that occurred at her place of work, which explains why she sued her employer.



* [[https://wordsinasentence.com/lachrymose-in-a-sentence/][Lachrymose]]

  =easily brought to tears=

  - After her husband died, my aunt became a lachrymose woman who couldn’t stop crying.
  - I do not enjoy watching sad movies with my lachrymose wife because she is way too sensitive.
  - When I watch television shows about people dying from cancer, I become very lachrymose.
  - The pictures of the dead children made everyone lachrymose and sad.
  - As James watched his daughter marry the man of her dreams, he became lachrymose and had to hold in his tears.
  - The funeral home was filled with lachrymose mourners.
  - After my sister lost the writing contest, she was lachrymose and in need of a hug.



* [[https://wordsinasentence.com/lackluster-in-a-sentence/][Lackluster]]

  =lacking brilliance and shine; dull; not exceptional; not worthy of special merit, attention, or interest=

  - Since she noticed that the response she was getting on the dating website was rather lackluster, Beth decided to spice up her profile and post a better photo.
  - After having played the same role onstage for over a year, Joel had nothing new to bring to the character, and critics noted that his performance had become lackluster.
  - In spite of heavy advertising, the new product only achieved disappointing, lackluster sales.
  - Even though her name is Violet, she makes a very lackluster effort at keeping up with her gardening, and now there are weeds where there used to be beautiful flowers.
  - Because Cole was such a lackluster host, we decided to leave the party and go celebrate somewhere else.
  - It finally rained, but not until the farmers had already taken in the most lackluster harvest in decades.
  - Compared to the profits of the previous two years, this year’s company report indicated lackluster earnings.



* [[https://wordsinasentence.com/lair-in-a-sentence/][Lair]]

  =a place inhabited by a wild animal, often a cave or a hole in the ground=

  - After stalking a sheep and ripping it to pieces, the tiger dragged its fresh kill to its lair.
  - Sticking her hand into a hole which she chanced upon in the wilderness, Lisa recoiled in horror when she felt the body of some reptile asleep in its lair.
  - Stumbling across a lair teeming with wild animals, Brian froze in terror.
  - The lion slumbered peacefully in its lair when it was suddenly awoken by the sounds of gunshots, infuriating the beast.



* [[https://wordsinasentence.com/lambaste-in-a-sentence/][Lambaste]]

  =to criticize someone harshly=

  - Even with its success, harsh party leaders continued to lambaste the plan for healthcare reform.
  - The rude shopper continued to lambaste the sales clerk for not moving quick enough.
  - As if complaining wasn’t enough, the young woman’s mother-in-law made an effort to lambaste her regarding her cooking and her housecleaning skills.
  - Trying to change his overly critical ways, the dater promised the matchmaker that he would not lambaste his date over small errors.



