ruby/L.html
<!DOCTYPE html>
<html>
<head>
<title>L</title>
<!-- 2018-06-05 Tue 21:06 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">L</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Labile</a></li>
<li><a href="#sec-2">2. Laceration</a></li>
<li><a href="#sec-3">3. Lachrymose</a></li>
<li><a href="#sec-4">4. Lackluster</a></li>
<li><a href="#sec-5">5. Lair</a></li>
<li><a href="#sec-6">6. Lambaste</a></li>
<li><a href="#sec-7">7. Lamentable</a></li>
<li><a href="#sec-8">8. Lampoon</a></li>
<li><a href="#sec-9">9. Languid</a></li>
<li><a href="#sec-10">10. Languish</a></li>
<li><a href="#sec-11">11. Languor</a></li>
<li><a href="#sec-12">12. Lanky</a></li>
<li><a href="#sec-13">13. Lapse</a></li>
<li><a href="#sec-14">14. Largesse</a></li>
<li><a href="#sec-15">15. Lassitude</a></li>
<li><a href="#sec-16">16. Latent</a></li>
<li><a href="#sec-17">17. Lateral</a></li>
<li><a href="#sec-18">18. Lattice</a></li>
<li><a href="#sec-19">19. Leery</a></li>
<li><a href="#sec-20">20. Leniency</a></li>
<li><a href="#sec-21">21. Levee</a></li>
<li><a href="#sec-22">22. Levy</a></li>
<li><a href="#sec-23">23. Lexicon</a></li>
<li><a href="#sec-24">24. Liability</a></li>
<li><a href="#sec-25">25. Libel</a></li>
<li><a href="#sec-26">26. Liberality</a></li>
<li><a href="#sec-27">27. Liberty</a></li>
<li><a href="#sec-28">28. Licentious</a></li>
<li><a href="#sec-29">29. Licit</a></li>
<li><a href="#sec-30">30. Ligneous</a></li>
<li><a href="#sec-31">31. Limbo</a></li>
<li><a href="#sec-32">32. Limn</a></li>
<li><a href="#sec-33">33. Liquidate</a></li>
<li><a href="#sec-34">34. Lithe</a></li>
<li><a href="#sec-35">35. Locution</a></li>
<li><a href="#sec-36">36. Loiter</a></li>
<li><a href="#sec-37">37. Lope</a></li>
<li><a href="#sec-38">38. Lopsided</a></li>
<li><a href="#sec-39">39. Lore</a></li>
<li><a href="#sec-40">40. Lout</a></li>
<li><a href="#sec-41">41. Lubricant</a></li>
<li><a href="#sec-42">42. Lucre</a></li>
<li><a href="#sec-43">43. Lucubration</a></li>
<li><a href="#sec-44">44. Lukewarm</a></li>
<li><a href="#sec-45">45. Lumber</a></li>
<li><a href="#sec-46">46. Luminary</a></li>
<li><a href="#sec-47">47. Lump</a></li>
<li><a href="#sec-48">48. Lurch</a></li>
<li><a href="#sec-49">49. Lurk</a></li>
<li><a href="#sec-50">50. Luscious</a></li>
<li><a href="#sec-51">51. Luster</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Labile</a></li>
<li><a href="#sec-2">2. Laceration</a></li>
<li><a href="#sec-3">3. Lachrymose</a></li>
<li><a href="#sec-4">4. Lackluster</a></li>
<li><a href="#sec-5">5. Lair</a></li>
<li><a href="#sec-6">6. Lambaste</a></li>
<li><a href="#sec-7">7. Lamentable</a></li>
<li><a href="#sec-8">8. Lampoon</a></li>
<li><a href="#sec-9">9. Languid</a></li>
<li><a href="#sec-10">10. Languish</a></li>
<li><a href="#sec-11">11. Languor</a></li>
<li><a href="#sec-12">12. Lanky</a></li>
<li><a href="#sec-13">13. Lapse</a></li>
<li><a href="#sec-14">14. Largesse</a></li>
<li><a href="#sec-15">15. Lassitude</a></li>
<li><a href="#sec-16">16. Latent</a></li>
<li><a href="#sec-17">17. Lateral</a></li>
<li><a href="#sec-18">18. Lattice</a></li>
<li><a href="#sec-19">19. Leery</a></li>
<li><a href="#sec-20">20. Leniency</a></li>
<li><a href="#sec-21">21. Levee</a></li>
<li><a href="#sec-22">22. Levy</a></li>
<li><a href="#sec-23">23. Lexicon</a></li>
<li><a href="#sec-24">24. Liability</a></li>
<li><a href="#sec-25">25. Libel</a></li>
<li><a href="#sec-26">26. Liberality</a></li>
<li><a href="#sec-27">27. Liberty</a></li>
<li><a href="#sec-28">28. Licentious</a></li>
<li><a href="#sec-29">29. Licit</a></li>
<li><a href="#sec-30">30. Ligneous</a></li>
<li><a href="#sec-31">31. Limbo</a></li>
<li><a href="#sec-32">32. Limn</a></li>
<li><a href="#sec-33">33. Liquidate</a></li>
<li><a href="#sec-34">34. Lithe</a></li>
<li><a href="#sec-35">35. Locution</a></li>
<li><a href="#sec-36">36. Loiter</a></li>
<li><a href="#sec-37">37. Lope</a></li>
<li><a href="#sec-38">38. Lopsided</a></li>
<li><a href="#sec-39">39. Lore</a></li>
<li><a href="#sec-40">40. Lout</a></li>
<li><a href="#sec-41">41. Lubricant</a></li>
<li><a href="#sec-42">42. Lucre</a></li>
<li><a href="#sec-43">43. Lucubration</a></li>
<li><a href="#sec-44">44. Lukewarm</a></li>
<li><a href="#sec-45">45. Lumber</a></li>
<li><a href="#sec-46">46. Luminary</a></li>
<li><a href="#sec-47">47. Lump</a></li>
<li><a href="#sec-48">48. Lurch</a></li>
<li><a href="#sec-49">49. Lurk</a></li>
<li><a href="#sec-50">50. Luscious</a></li>
<li><a href="#sec-51">51. Luster</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-06-05 21:06:27</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/labile-in-a-sentence/">Labile</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>easily or frequently changed</code>
</p>

<ul class="org-ul">
<li>My body’s response to dairy products is labile and usually hurts worse when I exercise after consumption.
</li>
<li>Some of the tribe’s customs were labile, while others are never changed and are followed to the t.
</li>
<li>Emotionally labile patients are not given stimulants since they tend to can cause moods to shift dramatically.
</li>
<li>The labile currency can be changed out easily when visiting a different country.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/laceration-in-a-sentence/">Laceration</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>an irregular open wound caused by a blunt impact to soft tissue</code>
</p>

<ul class="org-ul">
<li>Because the laceration was so deep and ugly, Dick was rushed to the emergency room by an ambulance.
</li>
<li>Joe suffered a laceration to his right temple when he was tossed off of his bike.
</li>
<li>After examining Jennifer’s hand from every angle, the nurse said that the laceration would heal by itself and that stitches were unnecessary.
</li>
<li>Linda’s foot laceration was the result of a fall that occurred at her place of work, which explains why she sued her employer.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/lachrymose-in-a-sentence/">Lachrymose</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>easily brought to tears</code>
</p>

<ul class="org-ul">
<li>After her husband died, my aunt became a lachrymose woman who couldn’t stop crying.
</li>
<li>I do not enjoy watching sad movies with my lachrymose wife because she is way too sensitive.
</li>
<li>When I watch television shows about people dying from cancer, I become very lachrymose.
</li>
<li>The pictures of the dead children made everyone lachrymose and sad.
</li>
<li>As James watched his daughter marry the man of her dreams, he became lachrymose and had to hold in his tears.
</li>
<li>The funeral home was filled with lachrymose mourners.
</li>
<li>After my sister lost the writing contest, she was lachrymose and in need of a hug.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/lackluster-in-a-sentence/">Lackluster</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>lacking brilliance and shine; dull; not exceptional; not worthy of special merit, attention, or interest</code>
</p>

<ul class="org-ul">
<li>Since she noticed that the response she was getting on the dating website was rather lackluster, Beth decided to spice up her profile and post a better photo.
</li>
<li>After having played the same role onstage for over a year, Joel had nothing new to bring to the character, and critics noted that his performance had become lackluster.
</li>
<li>In spite of heavy advertising, the new product only achieved disappointing, lackluster sales.
</li>
<li>Even though her name is Violet, she makes a very lackluster effort at keeping up with her gardening, and now there are weeds where there used to be beautiful flowers.
</li>
<li>Because Cole was such a lackluster host, we decided to leave the party and go celebrate somewhere else.
</li>
<li>It finally rained, but not until the farmers had already taken in the most lackluster harvest in decades.
</li>
<li>Compared to the profits of the previous two years, this year’s company report indicated lackluster earnings.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/lair-in-a-sentence/">Lair</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>a place inhabited by a wild animal, often a cave or a hole in the ground</code>
</p>

<ul class="org-ul">
<li>After stalking a sheep and ripping it to pieces, the tiger dragged its fresh kill to its lair.
</li>
<li>Sticking her hand into a hole which she chanced upon in the wilderness, Lisa recoiled in horror when she felt the body of some reptile asleep in its lair.
</li>
<li>Stumbling across a lair teeming with wild animals, Brian froze in terror.
</li>
<li>The lion slumbered peacefully in its lair when it was suddenly awoken by the sounds of gunshots, infuriating the beast.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/lambaste-in-a-sentence/">Lambaste</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>to criticize someone harshly</code>
</p>

<ul class="org-ul">
<li>Even with its success, harsh party leaders continued to lambaste the plan for healthcare reform.
</li>
<li>The rude shopper continued to lambaste the sales clerk for not moving quick enough.
</li>
<li>As if complaining wasn’t enough, the young woman’s mother-in-law made an effort to lambaste her regarding her cooking and her housecleaning skills.
</li>
<li>Trying to change his overly critical ways, the dater promised the matchmaker that he would not lambaste his date over small errors.
</li>
</ul>
</div>
</div>
