ruby/L.org
* [[https://wordsinasentence.com/lamentable-in-a-sentence/][Lamentable]]

  =worthy of criticism or regret=

  - Few events are as lamentable as an attack on innocent people by terrorists.
  - When Ana turned down Ted’s invite to the dance, her lamentable choice meant she had to sit home alone.
  - It is lamentable that today’s youth seem to have no respect for the police.
  - While mental health awareness has increased, the stigma that comes with having a mental disorder is still lamentable.


  - Because Freddy posted an uncomplimentary lampoon of his boss on his Facebook page, he soon found himself looking for new employment.
  - Sam wrote a harsh lampoon of the mayor and sent it to the newspaper, but the editor refused to publish it.
  - Ronnie maintains a popular blog that is basically a lampoon of the week’s television shows.
  - For the past few decades, the writers of “Saturday Night Live” have written one lampoon after another at the expense of whichever politicians happened to be in the news at the time.
  - In that kingdom, any subject who was foolish enough to publicly lampoon the king would be punished by having his tongue cut out of his mouth.
  - As a satirical writer for the newspaper, Jeff is always on the lookout for fresh targets to lampoon in his column.
  - Back in the 1970s, “The Dean Martin Show” began a practice of using celebrity roasts to lampoon entertainers, and they became popular form of entertainment that continues today.



* Lampoon

  - Because Freddy posted an uncomplimentary lampoon of his boss on his Facebook page, he soon found himself looking for new employment.
  - Sam wrote a harsh lampoon of the mayor and sent it to the newspaper, but the editor refused to publish it.
  - Ronnie maintains a popular blog that is basically a lampoon of the week’s television shows.
  - For the past few decades, the writers of “Saturday Night Live” have written one lampoon after another at the expense of whichever politicians happened to be in the news at the time.
  - In that kingdom, any subject who was foolish enough to publicly lampoon the king would be punished by having his tongue cut out of his mouth.
  - As a satirical writer for the newspaper, Jeff is always on the lookout for fresh targets to lampoon in his column.
  - Back in the 1970s, “The Dean Martin Show” began a practice of using celebrity roasts to lampoon entertainers, and they became popular form of entertainment that continues today.




* [[https://wordsinasentence.com/languid-in-a-sentence/][Languid]]

  =very slow and relaxed=

  - I always get my rest when I take a languid cruise vacation.
  - After a stressful day of work, I am going to enjoy a languid walk through the quiet park.
  - Because I enjoy a laidback pace, I enjoy living on the island which has a languid environment.
  - The dance required the veteran ballerina to make the complex turns at a languid but seductive speed.
  - Although Helen ate too much at dinner, she did not feel languid afterwards and was able to enjoy a quick run through the neighborhood.
  - I took pleasure in the languid attentions of the hairdresser as she gently washed my hair.
  - Because Jamie was too languid to leave the beach with her friends, she ended up missing her own birthday party.



* [[https://wordsinasentence.com/languish-in-a-sentence/][Languish]]

  =to be or become weak or dull; lose strength or vigor; fail to make progress or be successful=

  - If Congress allows the budget bill to languish on the shelf, then the country will find itself in a financial crisis.
  - While I don’t normally enjoy being out in the sun, if I have to languish somewhere hot all day, I choose Hawaii.
  - When the judge sentences the murderer, I hope he gives him a lifetime to languish in prison.
  - Are you going to languish in bed all Spring Break or do you plan on going outside and enjoying the sunlight?
  - Since business is in short demand, the mortgage companies have started to wonder how much longer the housing market will continue to languish.
  - Rather than sponsor a bill he finds objectionable, the majority leader will allow this one to languish on a pile in his office.
  - After being dumped by her boyfriend, my daughter did nothing but languish on her bed.



* [[https://wordsinasentence.com/languor-in-a-sentence/][Languor]]

  =weariness or exhaustion=

  - If you do not drink enough water, you will become dehydrated and fall into a state of languor.
  - The doctor could not identify the cause of the languor that kept Bess exhausted all day.
  - When the runner felt the languor threaten to deter her, she dug down and found the energy to complete the race.
  - The dark circles under Pam’s eyes expressed the languor she felt.
  - Even though the rescue workers were extremely exhausted, they ignored their languor and continued to search for bodies in the debris.
  - Symptoms of the virus include fever, diarrhea, abdominal pain, and a feeling of languor that keeps one extremely tired.
  - After a difficult eight-hour trek, the hikers quickly fell asleep in languor.



* [[https://wordsinasentence.com/lanky-in-a-sentence/][Lanky]]

  =awkwardly tall and skinny=

  - Long-limbed and lanky, it was hard for the man to fit inside the compact car.
  - His lanky appearance made him socially awkward but a beast on the basketball court.
  - The lanky boy’s physique seemed to be all arms and legs.
  - Lanky and lean, the girl’s parents were surprised by her height since they were both 5’6.



* [[https://wordsinasentence.com/lapse-in-a-sentence/][Lapse]]

  =A temporary failure; a slip=

  - His lapse in judgement led him to fall behind in his studies.
  - Without sleep, you are likely to have a lapse in reason, being unable to think clearly.
  - If you want to quit smoking, you cannot have a lapse and return to your old habit.
  - Even if you just commit one crime, that single lapse in character can land you in jail.
  - Giving into temptation, he let himself lapse back into old habits.
  - A surgeon cannot afford to have a lapse in his skills, as it could cost a patient’s life.
  - Though he had been insured previously, his lapse in life insurance coverage meant he was uninsured at death.



