ruby/L.html



<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/lamentable-in-a-sentence/">Lamentable</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>worthy of criticism or regret</code>
</p>

<ul class="org-ul">
<li>Few events are as lamentable as an attack on innocent people by terrorists.
</li>
<li>When Ana turned down Ted’s invite to the dance, her lamentable choice meant she had to sit home alone.
</li>
<li>It is lamentable that today’s youth seem to have no respect for the police.
</li>
<li>While mental health awareness has increased, the stigma that comes with having a mental disorder is still lamentable.
</li>
</ul>


<ul class="org-ul">
<li>Because Freddy posted an uncomplimentary lampoon of his boss on his Facebook page, he soon found himself looking for new employment.
</li>
<li>Sam wrote a harsh lampoon of the mayor and sent it to the newspaper, but the editor refused to publish it.
</li>
<li>Ronnie maintains a popular blog that is basically a lampoon of the week’s television shows.
</li>
<li>For the past few decades, the writers of “Saturday Night Live” have written one lampoon after another at the expense of whichever politicians happened to be in the news at the time.
</li>
<li>In that kingdom, any subject who was foolish enough to publicly lampoon the king would be punished by having his tongue cut out of his mouth.
</li>
<li>As a satirical writer for the newspaper, Jeff is always on the lookout for fresh targets to lampoon in his column.
</li>
<li>Back in the 1970s, “The Dean Martin Show” began a practice of using celebrity roasts to lampoon entertainers, and they became popular form of entertainment that continues today.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Lampoon</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Because Freddy posted an uncomplimentary lampoon of his boss on his Facebook page, he soon found himself looking for new employment.
</li>
<li>Sam wrote a harsh lampoon of the mayor and sent it to the newspaper, but the editor refused to publish it.
</li>
<li>Ronnie maintains a popular blog that is basically a lampoon of the week’s television shows.
</li>
<li>For the past few decades, the writers of “Saturday Night Live” have written one lampoon after another at the expense of whichever politicians happened to be in the news at the time.
</li>
<li>In that kingdom, any subject who was foolish enough to publicly lampoon the king would be punished by having his tongue cut out of his mouth.
</li>
<li>As a satirical writer for the newspaper, Jeff is always on the lookout for fresh targets to lampoon in his column.
</li>
<li>Back in the 1970s, “The Dean Martin Show” began a practice of using celebrity roasts to lampoon entertainers, and they became popular form of entertainment that continues today.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/languid-in-a-sentence/">Languid</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>very slow and relaxed</code>
</p>

<ul class="org-ul">
<li>I always get my rest when I take a languid cruise vacation.
</li>
<li>After a stressful day of work, I am going to enjoy a languid walk through the quiet park.
</li>
<li>Because I enjoy a laidback pace, I enjoy living on the island which has a languid environment.
</li>
<li>The dance required the veteran ballerina to make the complex turns at a languid but seductive speed.
</li>
<li>Although Helen ate too much at dinner, she did not feel languid afterwards and was able to enjoy a quick run through the neighborhood.
</li>
<li>I took pleasure in the languid attentions of the hairdresser as she gently washed my hair.
</li>
<li>Because Jamie was too languid to leave the beach with her friends, she ended up missing her own birthday party.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/languish-in-a-sentence/">Languish</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>to be or become weak or dull; lose strength or vigor; fail to make progress or be successful</code>
</p>

<ul class="org-ul">
<li>If Congress allows the budget bill to languish on the shelf, then the country will find itself in a financial crisis.
</li>
<li>While I don’t normally enjoy being out in the sun, if I have to languish somewhere hot all day, I choose Hawaii.
</li>
<li>When the judge sentences the murderer, I hope he gives him a lifetime to languish in prison.
</li>
<li>Are you going to languish in bed all Spring Break or do you plan on going outside and enjoying the sunlight?
</li>
<li>Since business is in short demand, the mortgage companies have started to wonder how much longer the housing market will continue to languish.
</li>
<li>Rather than sponsor a bill he finds objectionable, the majority leader will allow this one to languish on a pile in his office.
</li>
<li>After being dumped by her boyfriend, my daughter did nothing but languish on her bed.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/languor-in-a-sentence/">Languor</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>weariness or exhaustion</code>
</p>

<ul class="org-ul">
<li>If you do not drink enough water, you will become dehydrated and fall into a state of languor.
</li>
<li>The doctor could not identify the cause of the languor that kept Bess exhausted all day.
</li>
<li>When the runner felt the languor threaten to deter her, she dug down and found the energy to complete the race.
</li>
<li>The dark circles under Pam’s eyes expressed the languor she felt.
</li>
<li>Even though the rescue workers were extremely exhausted, they ignored their languor and continued to search for bodies in the debris.
</li>
<li>Symptoms of the virus include fever, diarrhea, abdominal pain, and a feeling of languor that keeps one extremely tired.
</li>
<li>After a difficult eight-hour trek, the hikers quickly fell asleep in languor.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/lanky-in-a-sentence/">Lanky</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>awkwardly tall and skinny</code>
</p>

<ul class="org-ul">
<li>Long-limbed and lanky, it was hard for the man to fit inside the compact car.
</li>
<li>His lanky appearance made him socially awkward but a beast on the basketball court.
</li>
<li>The lanky boy’s physique seemed to be all arms and legs.
</li>
<li>Lanky and lean, the girl’s parents were surprised by her height since they were both 5’6.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/lapse-in-a-sentence/">Lapse</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>A temporary failure; a slip</code>
</p>

<ul class="org-ul">
<li>His lapse in judgement led him to fall behind in his studies.
</li>
<li>Without sleep, you are likely to have a lapse in reason, being unable to think clearly.
</li>
<li>If you want to quit smoking, you cannot have a lapse and return to your old habit.
</li>
<li>Even if you just commit one crime, that single lapse in character can land you in jail.
</li>
<li>Giving into temptation, he let himself lapse back into old habits.
</li>
<li>A surgeon cannot afford to have a lapse in his skills, as it could cost a patient’s life.
</li>
<li>Though he had been insured previously, his lapse in life insurance coverage meant he was uninsured at death.
</li>
</ul>
</div>
</div>
