ruby/L.org
* [[https://wordsinasentence.com/largesse-in-a-sentence/][Largesse]]

  =generous acts of giving gifts or money to a large number of people=

  - Because of the millionaire’s largesse, twenty underprivileged graduates now have college scholarships.
  - An activist for the poor, Phillip is well-known for his largesse which helps many in need.
  - If it were not for the largesse of Diana’s charity, many people in the city would go hungry.
  - When I was in need, I benefited from the largesse of an anonymous donor.
  - Even before he won the lottery, Albert performed acts of largesse within the homeless community.
  - Government largesse should not be given to greedy corporations who take advantage of consumers.
  - Although I am glad my grandmother is a generous person, her largesse has almost put her in the poor house.




* [[https://wordsinasentence.com/lassitude-in-a-sentence/][Lassitude]]

  =tiredness and a lack of energy=

  - After the long race, Jack experienced a feeling of lassitude.
  - This morning, lassitude is preventing me from getting out of bed.
  - When my doctor asked me to describe my symptoms, my main complaint was lassitude since I had very little energy.
  - The stress at work and the stress in her marriage caused Liza to experience an extreme amount of lassitude which left her exhausted.
  - Since I had been feeling exhausted for several weeks, I started taking vitamins to cure my lassitude.
  - When Sarah’s anger left, all that remained inside of her was lassitude and the desire to fall asleep.
  - After finishing her exams, Danielle hoped to conquer her lassitude by drinking an energy drink.



* [[https://wordsinasentence.com/latent-in-a-sentence/][Latent]]

  =existing or present but concealed or inactive=

  - The detective asked the lab technician to search the room for latent fingerprints.
  - If Janet is anything like her mother, she will show a latent skill for singing when she reaches her teenage years.
  - The latent tension between the two brothers came to a head when the older brother punched his sibling in the face.
  - Hopefully the music retreat will allow me to find the latent talents inside of me.
  - When the builders dug into the ground, they discovered a latent source of oil.
  - The doctor does not know why the infection remained latent in your body for so long without revealing any symptoms.
  - With the art expert’s assistance, I was able to see the painter’s latent pattern of hiding birds in every picture.



* [[https://wordsinasentence.com/lateral-in-a-sentence/][Lateral]]

  =of or pertaining to the side=

  - A beam runs along the top of the bridge, offering lateral support to the structure.
  - Instead of jumping up and down, I placed a pile of books under both ends of a pole and jumped in a lateral direction.
  - Jack threw a lateral pass in the final seconds of the fourth quarter, which made no sense because it did not advance them toward the end zone.
  - Diane’s boss said that instead of promoting her, she would undergo a lateral repositioning, meaning that her new work would remain equivalent to the old.



* [[https://wordsinasentence.com/lattice-in-a-sentence/][Lattice]]

  =crisscross or diamond pattern with spaces in-between=

  - I pierced through the wooden lattice, splitting the diamond pattern in two.
  - The lattice on top of the apple pie is filled with cherries.
  - The window is covered by a lattice composed of oak and cherry wood.
  - Roy peeked through the lattice, widening the holes for a better view.



* [[https://wordsinasentence.com/leery-in-a-sentence/][Leery]]

  =suspicious or guarded=

  - The dog was leery of the man with the large stick.
  - If you are leery of going into the old house alone, you should have a male friend accompany you.
  - In this day and age, computer viruses are everywhere so people should be leery of emails from strangers.
  - Be leery of those too good to be true hotel offers because they are often timeshare scams.
  - Many people are leery of selling their homes because of the poor real estate market.
  - Because Jim is a recovering drug addict, he is leery of taking any medicine that has not been prescribed by his doctor.
  - Heather and Pete were leery of the nanny candidate who could not provide them with real references.



* [[https://wordsinasentence.com/leniency-in-a-sentence/][Leniency]]

  =quality of mercy or forgiveness=

  - Despite his history of violent, the judge decided to grant him leniency due to his quick admission of guilt.
  - Because he agreed to expose his supplier, the drug dealer was granted leniency in his sentencing.
  - Though they claim to be strict, the teachers often exercise leniency for those who normally behave.
  - Though not known for her leniency, the principle allowed the students misconduct to go unpunished.
  - Since he had no history of priors, the thief begged the judge for some leniency.
  - When the judge is in a good mood, he is often known to show leniency.
  - In spite of his friendly demeanor, the enforcer showed no leniency, punishing the offender to the fullest extent.





* [[https://wordsinasentence.com/levee-in-a-sentence/][Levee]]

  =an embankment built to stop a waterway from flooding=

  - Rushing water broke the levee, flowing over the embankment and flooding the land that the wall was supposed to protect.
  - A levee was created out of dirt and sandbags to keep creeping water from the Mississippi from flooding the fields.
  - The tall levee wall served as a protector and kept the strong waves from eroding away much of the coastland.
  - Inspecting the levee, government officials checked to see if the embankment was strong enough to hold the swelling river.



* [[https://wordsinasentence.com/levy-in-a-sentence/][Levy]]

  =to impose (a tax or fine)=

  - All countries that I am aware of maintain that the government has a right to levy taxes on its citizens.
  - The Presidential candidate promised to levy a tax on foreign production in an effort to stimulate American manufacturing.
  - When the governor decided to levy additional fees on tobacco products, smokers took to the streets in protest.
  - The cops levy additional fines on motorists that are caught speeding near public schools, because many children walk there.



