ruby/L.html



<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> <a href="https://wordsinasentence.com/largesse-in-a-sentence/">Largesse</a></h2>
<div class="outline-text-2" id="text-14">
<p>
<code>generous acts of giving gifts or money to a large number of people</code>
</p>

<ul class="org-ul">
<li>Because of the millionaire’s largesse, twenty underprivileged graduates now have college scholarships.
</li>
<li>An activist for the poor, Phillip is well-known for his largesse which helps many in need.
</li>
<li>If it were not for the largesse of Diana’s charity, many people in the city would go hungry.
</li>
<li>When I was in need, I benefited from the largesse of an anonymous donor.
</li>
<li>Even before he won the lottery, Albert performed acts of largesse within the homeless community.
</li>
<li>Government largesse should not be given to greedy corporations who take advantage of consumers.
</li>
<li>Although I am glad my grandmother is a generous person, her largesse has almost put her in the poor house.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> <a href="https://wordsinasentence.com/lassitude-in-a-sentence/">Lassitude</a></h2>
<div class="outline-text-2" id="text-15">
<p>
<code>tiredness and a lack of energy</code>
</p>

<ul class="org-ul">
<li>After the long race, Jack experienced a feeling of lassitude.
</li>
<li>This morning, lassitude is preventing me from getting out of bed.
</li>
<li>When my doctor asked me to describe my symptoms, my main complaint was lassitude since I had very little energy.
</li>
<li>The stress at work and the stress in her marriage caused Liza to experience an extreme amount of lassitude which left her exhausted.
</li>
<li>Since I had been feeling exhausted for several weeks, I started taking vitamins to cure my lassitude.
</li>
<li>When Sarah’s anger left, all that remained inside of her was lassitude and the desire to fall asleep.
</li>
<li>After finishing her exams, Danielle hoped to conquer her lassitude by drinking an energy drink.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> <a href="https://wordsinasentence.com/latent-in-a-sentence/">Latent</a></h2>
<div class="outline-text-2" id="text-16">
<p>
<code>existing or present but concealed or inactive</code>
</p>

<ul class="org-ul">
<li>The detective asked the lab technician to search the room for latent fingerprints.
</li>
<li>If Janet is anything like her mother, she will show a latent skill for singing when she reaches her teenage years.
</li>
<li>The latent tension between the two brothers came to a head when the older brother punched his sibling in the face.
</li>
<li>Hopefully the music retreat will allow me to find the latent talents inside of me.
</li>
<li>When the builders dug into the ground, they discovered a latent source of oil.
</li>
<li>The doctor does not know why the infection remained latent in your body for so long without revealing any symptoms.
</li>
<li>With the art expert’s assistance, I was able to see the painter’s latent pattern of hiding birds in every picture.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/lateral-in-a-sentence/">Lateral</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>of or pertaining to the side</code>
</p>

<ul class="org-ul">
<li>A beam runs along the top of the bridge, offering lateral support to the structure.
</li>
<li>Instead of jumping up and down, I placed a pile of books under both ends of a pole and jumped in a lateral direction.
</li>
<li>Jack threw a lateral pass in the final seconds of the fourth quarter, which made no sense because it did not advance them toward the end zone.
</li>
<li>Diane’s boss said that instead of promoting her, she would undergo a lateral repositioning, meaning that her new work would remain equivalent to the old.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/lattice-in-a-sentence/">Lattice</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>crisscross or diamond pattern with spaces in-between</code>
</p>

<ul class="org-ul">
<li>I pierced through the wooden lattice, splitting the diamond pattern in two.
</li>
<li>The lattice on top of the apple pie is filled with cherries.
</li>
<li>The window is covered by a lattice composed of oak and cherry wood.
</li>
<li>Roy peeked through the lattice, widening the holes for a better view.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/leery-in-a-sentence/">Leery</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>suspicious or guarded</code>
</p>

<ul class="org-ul">
<li>The dog was leery of the man with the large stick.
</li>
<li>If you are leery of going into the old house alone, you should have a male friend accompany you.
</li>
<li>In this day and age, computer viruses are everywhere so people should be leery of emails from strangers.
</li>
<li>Be leery of those too good to be true hotel offers because they are often timeshare scams.
</li>
<li>Many people are leery of selling their homes because of the poor real estate market.
</li>
<li>Because Jim is a recovering drug addict, he is leery of taking any medicine that has not been prescribed by his doctor.
</li>
<li>Heather and Pete were leery of the nanny candidate who could not provide them with real references.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/leniency-in-a-sentence/">Leniency</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>quality of mercy or forgiveness</code>
</p>

<ul class="org-ul">
<li>Despite his history of violent, the judge decided to grant him leniency due to his quick admission of guilt.
</li>
<li>Because he agreed to expose his supplier, the drug dealer was granted leniency in his sentencing.
</li>
<li>Though they claim to be strict, the teachers often exercise leniency for those who normally behave.
</li>
<li>Though not known for her leniency, the principle allowed the students misconduct to go unpunished.
</li>
<li>Since he had no history of priors, the thief begged the judge for some leniency.
</li>
<li>When the judge is in a good mood, he is often known to show leniency.
</li>
<li>In spite of his friendly demeanor, the enforcer showed no leniency, punishing the offender to the fullest extent.
</li>
</ul>
</div>
</div>





<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/levee-in-a-sentence/">Levee</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>an embankment built to stop a waterway from flooding</code>
</p>

<ul class="org-ul">
<li>Rushing water broke the levee, flowing over the embankment and flooding the land that the wall was supposed to protect.
</li>
<li>A levee was created out of dirt and sandbags to keep creeping water from the Mississippi from flooding the fields.
</li>
<li>The tall levee wall served as a protector and kept the strong waves from eroding away much of the coastland.
</li>
<li>Inspecting the levee, government officials checked to see if the embankment was strong enough to hold the swelling river.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/levy-in-a-sentence/">Levy</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>to impose (a tax or fine)</code>
</p>

<ul class="org-ul">
<li>All countries that I am aware of maintain that the government has a right to levy taxes on its citizens.
</li>
<li>The Presidential candidate promised to levy a tax on foreign production in an effort to stimulate American manufacturing.
</li>
<li>When the governor decided to levy additional fees on tobacco products, smokers took to the streets in protest.
</li>
<li>The cops levy additional fines on motorists that are caught speeding near public schools, because many children walk there.
</li>
</ul>
</div>
</div>
