ruby/L.org
* [[https://wordsinasentence.com/lexicon-in-a-sentence/][Lexicon]]

  =terminology geared to a particular topic or specific group of people=

  - In the first year of law school, we learned a large number of words that became the basics of our legal lexicon.
  - It is hard to understand what teenagers say because their lexicon is constantly changing.
  - Since I am not a software engineer, I could not understand the lexicon used by the programmers who joined me at my table in the cafeteria.
  - Rappers often create new words their fans use as lexicon in their own conversations.



* [[https://wordsinasentence.com/liability-in-a-sentence/][Liability]]

  =something or someone that creates a disadvantage or financial burden=

  - Since my baby’s daddy is not paying his child support, the government is going to deduct the liability from his paycheck each week.
  - Kate studied hard in high school so she would not have to deal with the liability that accompanied accepting a student loan.
  - After losing his job, John realized he could not afford the liability that came along with buying a new car.
  - My team member’s incompetence makes him a liability to our squad.



* Libel
  - I told Troy that I would sue him for libel if he posted that embarrassing picture of us on his Facebook page.
  - Although no one really believes them, the things she wrote about me in her book are pure libel.
  - If we didn’t have laws against libel, anyone could fall victim to malicious stories about them in print or on the internet.
  - Because the character in the story was obviously not based on her, the former movie star was basically laughed out of court when the judge determined that she had no grounds for libel.
  - As a writer for a tabloid, Frank keeps an attorney on retainer because he is always likely to libel some celebrity or politician just to sell newspapers.
  - When her ex-husband chose to libel her name and reputation in a tell-all book, Irene decided to sue him for all he was worth.
  - The girls wanted revenge against the volleyball coach for punishing them, so they wrote an editorial to libel her in the school newspaper.



* [[https://wordsinasentence.com/liberality-in-a-sentence/][Liberality]]

  =possessing the characteristics of someone who is generous and gives freely=

  - J.K. Rowling shows great liberality to the poor and often donates several thousands of dollars to the charities each year.
  - The Michaels family always showed their liberality every Sunday when they made huge donations to the church.
  - The wealthy young man always treated his friends with liberality and gave them money whenever they needed it.
  - With the combined liberality of his family and friends, Brandon was able to purchase his first car and start a government internship in Washington, D.C.



* [[https://wordsinasentence.com/liberty-in-a-sentence/][Liberty]]

  =the freedom to do and act as one pleases=

  - Fighting for their liberty, the men could not wait to be free from the King of England.
  - The slaves escaped to the north and cherished the liberty and freedom found there.
  - Because she was at liberty to do what she wanted, the rich woman decided to nap all day long.
  - Citizens in that country do not have the liberty to carry guns or weapons.



* [[https://wordsinasentence.com/licentious-meaning-in-a-sentence/][Licentious]]

  =lacking moral discipline or ignoring legal restraint, especially in sexual conduct=

  - It is assumed that pagan festivals once involved many licentious activities, including a number of sexual games.
  - After she became part of a wild crowd, the young girl engaged in licentious acts which shamed her religious family.
  - Even before she became a prostitute, Hazel was considered a licentious woman who lacked morals.
  - Tom is licentious and has no regard for morality or the law.
  - After being warned about his lewd and licentious behavior, my nephew continued to misbehave and got suspended from school.
  - As a religious institute of learning, we cannot tolerate any kind of licentious conduct.
  - A devout Christian, Henry knew having a licentious lifestyle would not earn him a place in heaven.



* [[https://wordsinasentence.com/licit-in-a-sentence/][Licit]]

  =lawful; not forbidden=

  - Although he did not agree with her choices, she was over 21 and he could not stop her licit drinking.
  - The licit drug was prescribed by her pharmacist but caused several unwanted side effects.
  - Though smoking marijuana is illegal in most of the United States, action is being taken across the country to make the drug licit and permissible to use.
  - The licit window tint passed inspection, however; the emissions test was failed.


* [[https://wordsinasentence.com/ligneous-in-a-sentence/][Ligneous]]

  =woody; looking like wood.=

  - The ligneous chest of drawers looked like it was made of solid wood but was really particle board.
  - My father doesn’t like the look of ligneous houses, but my mother is fond of homes made out of wood.
  - During the camping trip, the Boy Scouts looked for sticks and other ligneous matter to start a fire.
  - The first little pig built his house out of straw while the second searched for ligneous materials in the woods.



* [[https://wordsinasentence.com/limbo-in-a-sentence/][Limbo]]

  =being in a lost or unknown position=

  - That has created a limbo in terms of how the military deals with gender-specific policies.
  - She is in limbo regarding the selling of her home, but she feels confident everything will go through.
  - Stuck in limbo, I cannot decide if I want to stay home or go to a friend’s party tonight.
  - With statewide cuts to school funding and projected low enrollment, many school districts are in limbo.



* [[https://wordsinasentence.com/limn-in-a-sentence/][Limn]]

  =to represent in painting or words=

  - The painter is known to limn pictures of his lovers on oil canvases.
  - Several master artisans were asked to limn detailed pictures for the fire station, but only a few masterpieces were created.
  - The writer tried to limn his childhood events into shorts stories, but he had trouble with the plots.
  - Through his poems, the author was able to limn his feelings about love lost.



