ruby/L.html



<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> <a href="https://wordsinasentence.com/lexicon-in-a-sentence/">Lexicon</a></h2>
<div class="outline-text-2" id="text-23">
<p>
<code>terminology geared to a particular topic or specific group of people</code>
</p>

<ul class="org-ul">
<li>In the first year of law school, we learned a large number of words that became the basics of our legal lexicon.
</li>
<li>It is hard to understand what teenagers say because their lexicon is constantly changing.
</li>
<li>Since I am not a software engineer, I could not understand the lexicon used by the programmers who joined me at my table in the cafeteria.
</li>
<li>Rappers often create new words their fans use as lexicon in their own conversations.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/liability-in-a-sentence/">Liability</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>something or someone that creates a disadvantage or financial burden</code>
</p>

<ul class="org-ul">
<li>Since my baby’s daddy is not paying his child support, the government is going to deduct the liability from his paycheck each week.
</li>
<li>Kate studied hard in high school so she would not have to deal with the liability that accompanied accepting a student loan.
</li>
<li>After losing his job, John realized he could not afford the liability that came along with buying a new car.
</li>
<li>My team member’s incompetence makes him a liability to our squad.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> Libel</h2>
<div class="outline-text-2" id="text-25">
<ul class="org-ul">
<li>I told Troy that I would sue him for libel if he posted that embarrassing picture of us on his Facebook page.
</li>
<li>Although no one really believes them, the things she wrote about me in her book are pure libel.
</li>
<li>If we didn’t have laws against libel, anyone could fall victim to malicious stories about them in print or on the internet.
</li>
<li>Because the character in the story was obviously not based on her, the former movie star was basically laughed out of court when the judge determined that she had no grounds for libel.
</li>
<li>As a writer for a tabloid, Frank keeps an attorney on retainer because he is always likely to libel some celebrity or politician just to sell newspapers.
</li>
<li>When her ex-husband chose to libel her name and reputation in a tell-all book, Irene decided to sue him for all he was worth.
</li>
<li>The girls wanted revenge against the volleyball coach for punishing them, so they wrote an editorial to libel her in the school newspaper.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/liberality-in-a-sentence/">Liberality</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>possessing the characteristics of someone who is generous and gives freely</code>
</p>

<ul class="org-ul">
<li>J.K. Rowling shows great liberality to the poor and often donates several thousands of dollars to the charities each year.
</li>
<li>The Michaels family always showed their liberality every Sunday when they made huge donations to the church.
</li>
<li>The wealthy young man always treated his friends with liberality and gave them money whenever they needed it.
</li>
<li>With the combined liberality of his family and friends, Brandon was able to purchase his first car and start a government internship in Washington, D.C.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/liberty-in-a-sentence/">Liberty</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>the freedom to do and act as one pleases</code>
</p>

<ul class="org-ul">
<li>Fighting for their liberty, the men could not wait to be free from the King of England.
</li>
<li>The slaves escaped to the north and cherished the liberty and freedom found there.
</li>
<li>Because she was at liberty to do what she wanted, the rich woman decided to nap all day long.
</li>
<li>Citizens in that country do not have the liberty to carry guns or weapons.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/licentious-meaning-in-a-sentence/">Licentious</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>lacking moral discipline or ignoring legal restraint, especially in sexual conduct</code>
</p>

<ul class="org-ul">
<li>It is assumed that pagan festivals once involved many licentious activities, including a number of sexual games.
</li>
<li>After she became part of a wild crowd, the young girl engaged in licentious acts which shamed her religious family.
</li>
<li>Even before she became a prostitute, Hazel was considered a licentious woman who lacked morals.
</li>
<li>Tom is licentious and has no regard for morality or the law.
</li>
<li>After being warned about his lewd and licentious behavior, my nephew continued to misbehave and got suspended from school.
</li>
<li>As a religious institute of learning, we cannot tolerate any kind of licentious conduct.
</li>
<li>A devout Christian, Henry knew having a licentious lifestyle would not earn him a place in heaven.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/licit-in-a-sentence/">Licit</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>lawful; not forbidden</code>
</p>

<ul class="org-ul">
<li>Although he did not agree with her choices, she was over 21 and he could not stop her licit drinking.
</li>
<li>The licit drug was prescribed by her pharmacist but caused several unwanted side effects.
</li>
<li>Though smoking marijuana is illegal in most of the United States, action is being taken across the country to make the drug licit and permissible to use.
</li>
<li>The licit window tint passed inspection, however; the emissions test was failed.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> <a href="https://wordsinasentence.com/ligneous-in-a-sentence/">Ligneous</a></h2>
<div class="outline-text-2" id="text-30">
<p>
<code>woody; looking like wood.</code>
</p>

<ul class="org-ul">
<li>The ligneous chest of drawers looked like it was made of solid wood but was really particle board.
</li>
<li>My father doesn’t like the look of ligneous houses, but my mother is fond of homes made out of wood.
</li>
<li>During the camping trip, the Boy Scouts looked for sticks and other ligneous matter to start a fire.
</li>
<li>The first little pig built his house out of straw while the second searched for ligneous materials in the woods.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> <a href="https://wordsinasentence.com/limbo-in-a-sentence/">Limbo</a></h2>
<div class="outline-text-2" id="text-31">
<p>
<code>being in a lost or unknown position</code>
</p>

<ul class="org-ul">
<li>That has created a limbo in terms of how the military deals with gender-specific policies.
</li>
<li>She is in limbo regarding the selling of her home, but she feels confident everything will go through.
</li>
<li>Stuck in limbo, I cannot decide if I want to stay home or go to a friend’s party tonight.
</li>
<li>With statewide cuts to school funding and projected low enrollment, many school districts are in limbo.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> <a href="https://wordsinasentence.com/limn-in-a-sentence/">Limn</a></h2>
<div class="outline-text-2" id="text-32">
<p>
<code>to represent in painting or words</code>
</p>

<ul class="org-ul">
<li>The painter is known to limn pictures of his lovers on oil canvases.
</li>
<li>Several master artisans were asked to limn detailed pictures for the fire station, but only a few masterpieces were created.
</li>
<li>The writer tried to limn his childhood events into shorts stories, but he had trouble with the plots.
</li>
<li>Through his poems, the author was able to limn his feelings about love lost.
</li>
</ul>
</div>
</div>
