ruby/L.org
* [[https://wordsinasentence.com/liquidate-in-a-sentence/][Liquidate]]

  =to pay off debts using assets=

  - The judge ordered the business owner to liquidate in order to pay his liabilities.
  - If the company decides to liquidate to settle its debts, its stock value will fall because of the ensuing decrease in assets.
  - The studio must liquidate many of its assets to discharge obligations associated with its recent box office bomb.
  - Because the creditors want payment on months’ old debts, they are pressuring the car manufacturer to liquidate.




* [[https://wordsinasentence.com/lithe-in-a-sentence/][Lithe]]

  =gracefully flexible, and often accompanied by being thin and long=

  - While Corinne has the lithe, agile body that would be perfect for gymnastics, she is too tall to manage some of the events.
  - In one lithe movement, he swept her into his arms and began to waltz her around the room.
  - With a graceful bow of its lithe neck, the swan glided under the low bridge and out of sight.
  - With lithe, quick hands, the pickpocket worked his way through the crowd collecting wallets from the unsuspecting tourists.
  - As she waited for her music to begin, the figure skater formed her arms and legs into a lithe arrangement that resembled an opening blossom.
  - Lithe and stealthy, the cat crept soundlessly toward the unsuspecting sparrow.
  - Marcia sent her daughter to modeling school in the hope that she would develop a more graceful, lithe way of walking.



* [[https://wordsinasentence.com/locution-in-a-sentence/][Locution]]

  =a word or phrase commonly used in particular situations=

  - Although “LOL” is internet slang for “laughing out loud”, it has become an actual locution among the teenage girls in our school.
  - When we travel cross-country we love to pay attention to the changing locution of the locals.
  - Robert’s speech is saturated with the locution of old classic movies, which have assimilated so thoroughly into his personality.
  - Having spent three years living abroad, Kevin felt so good to be back home listening to the rhythms of the American locution.



* [[https://wordsinasentence.com/loiter-in-a-sentence/][Loiter]]

  =to stick around without any real purpose=

  - If you loiter in the parking lot for hours, the police will ask you to leave the premises.
  - Students will not loiter on campus if they really hate school.
  - Since James arrived at the doctor’s office an hour early, he decided to loiter outside for a while.
  - Fans often loiter in hotel lobbies to see if they can catch a glimpse of their favorite celebrities.



* [[https://wordsinasentence.com/lope-in-a-sentence/][Lope]]

  =to take a longer footstep while running or walking=

  - Sprinters usually will lope in their lanes in order to ensure victory at the finish line of the race.
  - When the man saw his injured child, he quickened his pace and decided to lope to get to her.
  - Several horses lope down the field when a sudden loud noise startled them.
  - Competing against her rival, Mary decided to lope around the track as opposed to taking shorter steps.



* [[https://wordsinasentence.com/lopsided-in-a-sentence/][Lopsided]]

  =uneven or unbalanced=

  - Not realizing the table was lopsided, the patron placed his drink on it and water went everywhere!
  - Wiggling back and forth, the lopsided chair distracted the worker from finishing her work.
  - The lopsided lamp had a bit of charm, although it didn’t sit up straight, it still lit the room.
  - Try as he might, the would-be carpenter could never build a table that wasn’t lopsided!



* [[https://wordsinasentence.com/lore-in-a-sentence/][Lore]]

  =information and wisdom gained through tradition=

  - Lore was passed around the campfire in the form of old folktales.
  - Old wives tales and other lore was used to predict the sex of the baby.
  - Gaining a bit of lore from the elderly woman, the girl now felt she understood the situation better.
  - The Native American tribe prided itself on protecting its traditional lore and ability to pass this knowledge down to future generations.



* [[https://wordsinasentence.com/lout-in-a-sentence/][Lout]]

  =an uncooperative and impolite male=

  - When the neighbors witnessed his cruelty to animals, they informed the police of the actions of the lout.
  - “Take the lout out of here!” the medieval judge ordered his men to take the criminal immediately to the gallows.
  - Viewing the violent scene from his window, Alvin yelled at the lout to stop beating the man in the street.
  - No punishment was severe enough to stop the lout from bullying and picking on weaker students at the school because he would always continue the brutality.



* [[https://wordsinasentence.com/lubricant-in-a-sentence/][Lubricant]]

  =oil applied to something to reduce friction=

  - Applying excessive amounts of lubricant to the floor caused many customers to slip.
  - Without a lubricant to reduce the rubbing, the machine gears continued to grind loudly.
  - Lubricant added to the outside of the racetrack allowed the boy’s toy cars to move much faster.
  - Oil is a lubricant that can be successfully used to reduce friction in many types of machinery.



* [[https://wordsinasentence.com/lucre-in-a-sentence/][Lucre]]

  =money or profit gained illegally or immorally=

  - Hiding the lucre in many different accounts, the mobsters kept a watchful eye on their funds.
  - Drug lucre was laundered so that the authorities could not seize it during the bust.
  - Gangsters searched the house for hidden lucre but they only found a measly hundred dollars.
  - Without any lucre or significant cash flow, the hustlers had no way to re-up their product.



* [[https://wordsinasentence.com/lucubration-in-a-sentence/][Lucubration]]

  =the process of applying oil or a similar substance to make something run more smoothly=

  - The farmer applied oil to the tractor gears and explained that proper lubrication is required to keep his machine running.
  - Lubrication of the woman’s swollen finger was the only thing that helped her slip her ring off.
  - The sun-bather believed in lubrication and always oiled her body up with oil before relaxing in the sun.
  - All that squeaky door needs is a little oil-based lubrication to smooth its hinges.




