ruby/L.html



<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> <a href="https://wordsinasentence.com/liquidate-in-a-sentence/">Liquidate</a></h2>
<div class="outline-text-2" id="text-33">
<p>
<code>to pay off debts using assets</code>
</p>

<ul class="org-ul">
<li>The judge ordered the business owner to liquidate in order to pay his liabilities.
</li>
<li>If the company decides to liquidate to settle its debts, its stock value will fall because of the ensuing decrease in assets.
</li>
<li>The studio must liquidate many of its assets to discharge obligations associated with its recent box office bomb.
</li>
<li>Because the creditors want payment on months’ old debts, they are pressuring the car manufacturer to liquidate.
</li>
</ul>
</div>
</div>




<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> <a href="https://wordsinasentence.com/lithe-in-a-sentence/">Lithe</a></h2>
<div class="outline-text-2" id="text-34">
<p>
<code>gracefully flexible, and often accompanied by being thin and long</code>
</p>

<ul class="org-ul">
<li>While Corinne has the lithe, agile body that would be perfect for gymnastics, she is too tall to manage some of the events.
</li>
<li>In one lithe movement, he swept her into his arms and began to waltz her around the room.
</li>
<li>With a graceful bow of its lithe neck, the swan glided under the low bridge and out of sight.
</li>
<li>With lithe, quick hands, the pickpocket worked his way through the crowd collecting wallets from the unsuspecting tourists.
</li>
<li>As she waited for her music to begin, the figure skater formed her arms and legs into a lithe arrangement that resembled an opening blossom.
</li>
<li>Lithe and stealthy, the cat crept soundlessly toward the unsuspecting sparrow.
</li>
<li>Marcia sent her daughter to modeling school in the hope that she would develop a more graceful, lithe way of walking.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> <a href="https://wordsinasentence.com/locution-in-a-sentence/">Locution</a></h2>
<div class="outline-text-2" id="text-35">
<p>
<code>a word or phrase commonly used in particular situations</code>
</p>

<ul class="org-ul">
<li>Although “LOL” is internet slang for “laughing out loud”, it has become an actual locution among the teenage girls in our school.
</li>
<li>When we travel cross-country we love to pay attention to the changing locution of the locals.
</li>
<li>Robert’s speech is saturated with the locution of old classic movies, which have assimilated so thoroughly into his personality.
</li>
<li>Having spent three years living abroad, Kevin felt so good to be back home listening to the rhythms of the American locution.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> <a href="https://wordsinasentence.com/loiter-in-a-sentence/">Loiter</a></h2>
<div class="outline-text-2" id="text-36">
<p>
<code>to stick around without any real purpose</code>
</p>

<ul class="org-ul">
<li>If you loiter in the parking lot for hours, the police will ask you to leave the premises.
</li>
<li>Students will not loiter on campus if they really hate school.
</li>
<li>Since James arrived at the doctor’s office an hour early, he decided to loiter outside for a while.
</li>
<li>Fans often loiter in hotel lobbies to see if they can catch a glimpse of their favorite celebrities.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> <a href="https://wordsinasentence.com/lope-in-a-sentence/">Lope</a></h2>
<div class="outline-text-2" id="text-37">
<p>
<code>to take a longer footstep while running or walking</code>
</p>

<ul class="org-ul">
<li>Sprinters usually will lope in their lanes in order to ensure victory at the finish line of the race.
</li>
<li>When the man saw his injured child, he quickened his pace and decided to lope to get to her.
</li>
<li>Several horses lope down the field when a sudden loud noise startled them.
</li>
<li>Competing against her rival, Mary decided to lope around the track as opposed to taking shorter steps.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> <a href="https://wordsinasentence.com/lopsided-in-a-sentence/">Lopsided</a></h2>
<div class="outline-text-2" id="text-38">
<p>
<code>uneven or unbalanced</code>
</p>

<ul class="org-ul">
<li>Not realizing the table was lopsided, the patron placed his drink on it and water went everywhere!
</li>
<li>Wiggling back and forth, the lopsided chair distracted the worker from finishing her work.
</li>
<li>The lopsided lamp had a bit of charm, although it didn’t sit up straight, it still lit the room.
</li>
<li>Try as he might, the would-be carpenter could never build a table that wasn’t lopsided!
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> <a href="https://wordsinasentence.com/lore-in-a-sentence/">Lore</a></h2>
<div class="outline-text-2" id="text-39">
<p>
<code>information and wisdom gained through tradition</code>
</p>

<ul class="org-ul">
<li>Lore was passed around the campfire in the form of old folktales.
</li>
<li>Old wives tales and other lore was used to predict the sex of the baby.
</li>
<li>Gaining a bit of lore from the elderly woman, the girl now felt she understood the situation better.
</li>
<li>The Native American tribe prided itself on protecting its traditional lore and ability to pass this knowledge down to future generations.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> <a href="https://wordsinasentence.com/lout-in-a-sentence/">Lout</a></h2>
<div class="outline-text-2" id="text-40">
<p>
<code>an uncooperative and impolite male</code>
</p>

<ul class="org-ul">
<li>When the neighbors witnessed his cruelty to animals, they informed the police of the actions of the lout.
</li>
<li>“Take the lout out of here!” the medieval judge ordered his men to take the criminal immediately to the gallows.
</li>
<li>Viewing the violent scene from his window, Alvin yelled at the lout to stop beating the man in the street.
</li>
<li>No punishment was severe enough to stop the lout from bullying and picking on weaker students at the school because he would always continue the brutality.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> <a href="https://wordsinasentence.com/lubricant-in-a-sentence/">Lubricant</a></h2>
<div class="outline-text-2" id="text-41">
<p>
<code>oil applied to something to reduce friction</code>
</p>

<ul class="org-ul">
<li>Applying excessive amounts of lubricant to the floor caused many customers to slip.
</li>
<li>Without a lubricant to reduce the rubbing, the machine gears continued to grind loudly.
</li>
<li>Lubricant added to the outside of the racetrack allowed the boy’s toy cars to move much faster.
</li>
<li>Oil is a lubricant that can be successfully used to reduce friction in many types of machinery.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> <a href="https://wordsinasentence.com/lucre-in-a-sentence/">Lucre</a></h2>
<div class="outline-text-2" id="text-42">
<p>
<code>money or profit gained illegally or immorally</code>
</p>

<ul class="org-ul">
<li>Hiding the lucre in many different accounts, the mobsters kept a watchful eye on their funds.
</li>
<li>Drug lucre was laundered so that the authorities could not seize it during the bust.
</li>
<li>Gangsters searched the house for hidden lucre but they only found a measly hundred dollars.
</li>
<li>Without any lucre or significant cash flow, the hustlers had no way to re-up their product.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> <a href="https://wordsinasentence.com/lucubration-in-a-sentence/">Lucubration</a></h2>
<div class="outline-text-2" id="text-43">
<p>
<code>the process of applying oil or a similar substance to make something run more smoothly</code>
</p>

<ul class="org-ul">
<li>The farmer applied oil to the tractor gears and explained that proper lubrication is required to keep his machine running.
</li>
<li>Lubrication of the woman’s swollen finger was the only thing that helped her slip her ring off.
</li>
<li>The sun-bather believed in lubrication and always oiled her body up with oil before relaxing in the sun.
</li>
<li>All that squeaky door needs is a little oil-based lubrication to smooth its hinges.
</li>
</ul>
</div>
</div>
