ruby/L.org
* [[https://wordsinasentence.com/lukewarm-in-a-sentence/][Lukewarm]]

  =moderately warm; tepid=

  - Disappointed by his lukewarm chicken wings, the diner requested hot ones from the kitchen.
  - Lukewarm water was added to the baby’s bath to cool it off.
  - With the sun beating down, the lukewarm water felt cool again the swimmer’s skin.
  - The chef’s detailed recipe called for lukewarm water, two parts cold and one part boiling.



* [[https://wordsinasentence.com/lumber-in-a-sentence/][Lumber]]

  =raw cut timber beams=

  - Environmentalists protested the lumberjacks’ actions because they were chopping down all the trees for their lumber.
  - Once the logging company finished the order, the workers would pile the lumber into a truck headed for the paper mill.
  - After the trees were chopped down, the logs were sawed, shaped, and sanded to become pieces of lumber.
  - The product was still considered lumber since it was a raw material, but it would become a wood product when it was transformed into a floorboard.



* [[https://wordsinasentence.com/luminary-in-a-sentence/][Luminary]]

  =a person who influences or motivates other people=

  - Because Dr. Swanson is a luminary in the medical profession, he recently had a surgical procedure named after him.
  - The luminary will be honored for his contributions to society at a gala next week.
  - Since the pope is a luminary who wants to make the world a better place, he deserves to win the Nobel Peace Prize.
  - Thousands of people have requested tickets to hear the luminary speak about serving others.


* [[https://wordsinasentence.com/lump-in-a-sentence/][Lump]]

  =a swelling under the skin, often caused by infection or disease=

  - A lump on the patient’s neck meant that his cancer may have returned.
  - After removing the lump from James’s neck, his doctor said that he would send the swollen tissue off for further testing.
  - Angie hit her head on the dresser and a small lump began to form.
  - Since gaining weight, the young woman hates the flabby lump that has appeared under her chin.



* [[https://wordsinasentence.com/lurch-in-a-sentence/][Lurch]]

  =to move around in a sneaky manner=

  - The cat will lurch around the corner to spy on the sleeping dog.
  - Thanks to the security footage, the police were able to watch the burglar lurch outside the jewelry store.
  - The sleepy security guard did not see the mental patients lurch out of the hospital.
  - From the van, the spies watched their cohort lurch around the building before scaling up the wall.



* [[https://wordsinasentence.com/lurk-in-a-sentence/][Lurk]]

  =to hide from sight until the optimal moment in order to attack=

  - Hungry lions lurk in the tall grass and wait for unsuspecting gazelles to cross their path.
  - Soldiers lurk in the darkness, waiting for any sign of moment from enemy forces.
  - Dangers lurk in the shadows, biding their time before ambushing the unsuspecting victim.
  - The jewel thieves lurk in the closet, waiting for the museum to close for the night before they make their move.



* [[https://wordsinasentence.com/luscious-in-a-sentence/][Luscious]]

  =extremely appealing in smell, taste, or appearance=

  - I wanted to take a bite of the luscious apple.
  - Because the bread smelled luscious, Tom decided to go into the bakery.
  - Jim couldn't stop staring at the girl’s luscious lips.
  - The banana split is making me hungry because it looks so luscious in the advertisement.



* [[https://wordsinasentence.com/luster-in-a-sentence/][Luster]]

  =shine, polish or sparkle=

  - The luster of the holiday lights shone brightly on the freshly fallen snow.
  - In order to restore its luster, the man rubbed the brassy finish of the old tool.
  - The hairstylist promised that the conditioner would add luster to the client’s hair.
  - The shopkeeper admired the luster of the fine silver in his collection.



#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>