ruby/L.html




<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> <a href="https://wordsinasentence.com/lukewarm-in-a-sentence/">Lukewarm</a></h2>
<div class="outline-text-2" id="text-44">
<p>
<code>moderately warm; tepid</code>
</p>

<ul class="org-ul">
<li>Disappointed by his lukewarm chicken wings, the diner requested hot ones from the kitchen.
</li>
<li>Lukewarm water was added to the baby’s bath to cool it off.
</li>
<li>With the sun beating down, the lukewarm water felt cool again the swimmer’s skin.
</li>
<li>The chef’s detailed recipe called for lukewarm water, two parts cold and one part boiling.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> <a href="https://wordsinasentence.com/lumber-in-a-sentence/">Lumber</a></h2>
<div class="outline-text-2" id="text-45">
<p>
<code>raw cut timber beams</code>
</p>

<ul class="org-ul">
<li>Environmentalists protested the lumberjacks’ actions because they were chopping down all the trees for their lumber.
</li>
<li>Once the logging company finished the order, the workers would pile the lumber into a truck headed for the paper mill.
</li>
<li>After the trees were chopped down, the logs were sawed, shaped, and sanded to become pieces of lumber.
</li>
<li>The product was still considered lumber since it was a raw material, but it would become a wood product when it was transformed into a floorboard.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> <a href="https://wordsinasentence.com/luminary-in-a-sentence/">Luminary</a></h2>
<div class="outline-text-2" id="text-46">
<p>
<code>a person who influences or motivates other people</code>
</p>

<ul class="org-ul">
<li>Because Dr. Swanson is a luminary in the medical profession, he recently had a surgical procedure named after him.
</li>
<li>The luminary will be honored for his contributions to society at a gala next week.
</li>
<li>Since the pope is a luminary who wants to make the world a better place, he deserves to win the Nobel Peace Prize.
</li>
<li>Thousands of people have requested tickets to hear the luminary speak about serving others.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> <a href="https://wordsinasentence.com/lump-in-a-sentence/">Lump</a></h2>
<div class="outline-text-2" id="text-47">
<p>
<code>a swelling under the skin, often caused by infection or disease</code>
</p>

<ul class="org-ul">
<li>A lump on the patient’s neck meant that his cancer may have returned.
</li>
<li>After removing the lump from James’s neck, his doctor said that he would send the swollen tissue off for further testing.
</li>
<li>Angie hit her head on the dresser and a small lump began to form.
</li>
<li>Since gaining weight, the young woman hates the flabby lump that has appeared under her chin.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> <a href="https://wordsinasentence.com/lurch-in-a-sentence/">Lurch</a></h2>
<div class="outline-text-2" id="text-48">
<p>
<code>to move around in a sneaky manner</code>
</p>

<ul class="org-ul">
<li>The cat will lurch around the corner to spy on the sleeping dog.
</li>
<li>Thanks to the security footage, the police were able to watch the burglar lurch outside the jewelry store.
</li>
<li>The sleepy security guard did not see the mental patients lurch out of the hospital.
</li>
<li>From the van, the spies watched their cohort lurch around the building before scaling up the wall.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> <a href="https://wordsinasentence.com/lurk-in-a-sentence/">Lurk</a></h2>
<div class="outline-text-2" id="text-49">
<p>
<code>to hide from sight until the optimal moment in order to attack</code>
</p>

<ul class="org-ul">
<li>Hungry lions lurk in the tall grass and wait for unsuspecting gazelles to cross their path.
</li>
<li>Soldiers lurk in the darkness, waiting for any sign of moment from enemy forces.
</li>
<li>Dangers lurk in the shadows, biding their time before ambushing the unsuspecting victim.
</li>
<li>The jewel thieves lurk in the closet, waiting for the museum to close for the night before they make their move.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> <a href="https://wordsinasentence.com/luscious-in-a-sentence/">Luscious</a></h2>
<div class="outline-text-2" id="text-50">
<p>
<code>extremely appealing in smell, taste, or appearance</code>
</p>

<ul class="org-ul">
<li>I wanted to take a bite of the luscious apple.
</li>
<li>Because the bread smelled luscious, Tom decided to go into the bakery.
</li>
<li>Jim couldn't stop staring at the girl’s luscious lips.
</li>
<li>The banana split is making me hungry because it looks so luscious in the advertisement.
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> <a href="https://wordsinasentence.com/luster-in-a-sentence/">Luster</a></h2>
<div class="outline-text-2" id="text-51">
<p>
<code>shine, polish or sparkle</code>
</p>

<ul class="org-ul">
<li>The luster of the holiday lights shone brightly on the freshly fallen snow.
</li>
<li>In order to restore its luster, the man rubbed the brassy finish of the old tool.
</li>
<li>The hairstylist promised that the conditioner would add luster to the client’s hair.
</li>
<li>The shopkeeper admired the luster of the fine silver in his collection.
</li>
</ul>



<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>